#@ # 
#@ # Running icc2_shell Version T-2022.03-SP4 for linux64 -- Aug 31, 2022
#@ # Date:   Thu Apr 24 10:07:55 2025
#@ # Run by: Vaishnavii@mavenserver-RH2
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
create_lib -technology /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/tech/saed32nm_1p9m.tf \
	   -ref_libs  { \
                         /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/CLIBs/saed32_hvt.ndm  \
                         /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/CLIBs/saed32_lvt.ndm \
                         /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/CLIBs/saed32_rvt.ndm  \
                         /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/CLIBs/saed32_sram_lp.ndm} riscv_MACRO_no_clk_alu_block
read_verilog /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/rtl/RISC_V_macro_no_clk_alu.v 
link_block
win_set_filter -visible -class cell -filter {clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class pseudo_bump -filter {deleted}
win_set_filter -visible -class pseudo_tsv -filter {deleted}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-82}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class pseudo_bump -filter {deleted}
win_set_filter -class pseudo_tsv -filter {deleted}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-82}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
reset_upf
load_upf /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/script/ricsv_MACRO_no_clk_UPF.upf 
commit_upf
read_parasitic_tech -name {riscv_MACRO_no_clk_1} 
                    -tlup {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/tech/saed32nm_1p9m_Cmin.lv.tluplus} \
                    -layermap {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V//tech/saed32nm_tf_itf_tluplus.map}
read_parasitic_tech -name {riscv_MACRO_no_clk_1} \
                    -tlup {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/tech/saed32nm_1p9m_Cmin.lv.tluplus} \
                    -layermap {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V//tech/saed32nm_tf_itf_tluplus.map}
read_parasitic_tech -name {riscv_MACRO_no_clk_1} \
                    -tlup {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/tech/saed32nm_1p9m_Cmin.lv.tluplus} \
                    -layermap {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/tech/saed32nm_tf_itf_tluplus.map}

read_parasitic_tech -name {riscv_MACRO_no_clk_alu} \
                    -tlup {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref/tech/saed32nm_1p9m_Cmin.lv.tluplus} \
                    -layermap {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/tech/saed32nm_tf_itf_tluplus.map}
read_parasitic_tech -name {riscv_MACRO_no_clk_alu} \
                    -tlup {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ref//tech/saed32nm_1p9m_Cmin.lv.tluplus} \
                    -layermap {/home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/tech/saed32nm_tf_itf_tluplus.map}
read_parasitic_tech -name {riscv_MACRO_no_clk_1} -tlup {../../../ref/tech/saed32nm_1p9m_Cmin.lv.tluplus} -layermap  \
{../../../ref/tech/saed32nm_tf_itf_tluplus.map}

read_parasitic_tech -name {riscv_MACRO_no_clk_alu} -tlup {../../../ref/tech/saed32nm_1p9m_Cmin.lv.tluplus} -layermap  \
{../../../ref/tech/saed32nm_tf_itf_tluplus.map}
current_corner default

set_parasitic_parameters -early_spec riscv_MACRO_no_clk_1 -late_spec riscv_MACRO_no_clk_1

set_process_number 0.99 -corners default

set_temperature 125 -corners default

set_voltage 0.75 -corners default

current_mode default

set_scenario_status default -active true -setup true -hold true -max_transition true -max_capacitance true -min_capacitance true -leakage_power true  \
-dynamic_power true
initialize_floorplan -control_type die -side_ratio {2.5 2.5} -core_offset {1.8} -core_utilization {0.7} -orientation N
link_design
remove_pg_strategies -all
remove_pg_patterns -all
remove_pg_regions -all
remove_pg_via_master_rules -all
remove_pg_strategy_via_rules -all
remove_routes -net_types {power ground} -ring -stripe -macro_pin_connect -lib_cell_pin_connect > /dev/null

connect_pg_net

##########################################################################
# Horizonal metal layers: M1,M7
# Vertical Metal layers: M2,M6

# RING CREATION (M8 & M9)
# M8 (min width = 0.056; max width = 5; min_spacing = 0.056)
# M9 (min width = 0.056; max width = 5; min_spacing = 0.056)


create_pg_ring_pattern ring_pattern -horizontal_layer M7 \
   -horizontal_width {0.3} -horizontal_spacing {0.35} \
   -vertical_layer M6 -vertical_width {0.3} -vertical_spacing {0.35}
 
set_pg_strategy core_ring \
   -pattern {{name: ring_pattern} \
   {nets: {VDD VSS }} {offset: {0.2 0.2}}} -core \
	-extension {stop:design_boundary_and_generate_pin}
 
compile_pg -strategies core_ring


# MESH CREATION (M8 & M9)
# M8 (min width = 0.056; max width = 5; min_spacing = 0.056)
# M9 (min width = 0.056; max width = 5; min_spacing = 0.056)
create_pg_mesh_pattern P_top_two \
	-layers { \
		{ {horizontal_layer: M7} {width: 0.2} {spacing: interleaving} {pitch: 6.687} {offset: 0.836}  {trim : true} } \
		{ {vertical_layer: M6}   {width: 0.2} {spacing: interleaving} {pitch: 7}   {trim : true} } \
		} \
	-via_rule { {intersection: adjacent} {via_master : default} }

set_pg_strategy M7M6_mesh -pattern {{name: P_top_two } {nets: VDD VSS}} -core \
                          -extension {stop:outermost_ring}

compile_pg -strategies M7M6_mesh 

# LOWER MESH CREATION (M2)
# M2 (min width = 0.056; max width = 5; min_spacing = 0.056)

create_pg_mesh_pattern P_m2_triple \
	-layers { \
		{ {vertical_layer: M2} {width: 0.2} {spacing: interleaving} {pitch: 7}  {trim : true} } \
		} \
	-via_rule { {intersection: adjacent} {via_master : default} }

 
set_pg_strategy M2_mesh -pattern {{name: P_m2_triple } {nets: VDD VSS}} -core \
                         
compile_pg -strategies M2_mesh


# RAIL CREATION (M1)
# M1 (min width = 0.05; max width = 5; min_spacing = 0.056)

create_pg_std_cell_conn_pattern rail_pattern -layers M1
 
set_pg_strategy M1_rails -core \
   -pattern {{name: rail_pattern}{nets: VDD VSS}}
 
compile_pg -strategies M1_rails

################################

set_block_pin_constraints -self -allowed_layers {M4 M5} -sides {3 4}
place_pins -self
check_pg_connectivity 
check_pg_drc 
check_pg_missing_vias
shape_blocks
create_placement -floorplan 
legalize_placement
check_pg_drc 
check_pg_connectivity 
check_pg_missing_vias
place_opt
gui_show_error_data
gui_set_error_browser_option -show_mode all
gui_set_error_browser_option -view_mode zoom
gui_set_error_browser_option -zoom_factor 1.000000
gui_set_error_browser_option -grouping type
gui_error_browser -show
gui_open_error_data -name {DRC_report_by_check_pg_drc}
gui_set_current_errors -data_name {DRC_report_by_check_pg_drc} -group {Metal Spacing}
gui_set_selected_errors -replace [gui_get_errors -data_name {DRC_report_by_check_pg_drc} -id {0}] -force
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showPin -value true
win_set_select_class -visible {cell pin port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_select_class {cell pin port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
win_select_objects -slct_targets global -at {8.693 1.816} -radius 0.0002
win_select_objects -slct_targets global -at {8.655 1.809} -radius 0.0002
gui_set_mouse_tool_option -tool SELECT -option {Operation} -value {Replace}
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateViaTool
gui_set_mouse_tool_option -tool CreateViaTool -option {xPitch} -value {0.120}
gui_set_mouse_tool_option -tool CreateViaTool -option {yPitch} -value {0.120}
gui_set_mouse_tool_option -tool CreateViaTool -option {master} -value {VIA12SQ_C}
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
win_select_objects -slct_targets global -at {8.662 1.831} -radius 0.0002
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {8.688 1.813}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.688 1.813}
win_select_objects -slct_targets global -at {8.702 1.838} -radius 0.0003
win_select_objects -slct_targets global -at {8.701 1.838} -radius 0.0003 -index 1
win_select_objects -slct_targets global -at {8.696 1.838} -radius 0.0003
win_select_objects -slct_targets global -at {8.696 1.838} -radius 0.0003 -index 1
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.676 1.815}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.676 1.815}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.678 1.814}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.678 1.813}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.678 1.813}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.682 1.810}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {8.681 1.803}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {8.777 1.564}
win_select_objects -slct_targets global -at {8.281 2.989} -radius 0.016
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start MoveTool
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{7.944 3.021} {8.713 2.733}} -scale 0.016
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
check_pg_drc
undo
place_opt
set_voltage 0.75 -object-corners default
set_voltage 0.75 -object_list VDD -corners default
place_opt
redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }














check_pg_drc 
place_opt
check_pg_drc
check_pg_missing_vias
check_pg_connectivity
set_routing_rule all -clear -default_rule -min_routing_layer 1 -max_routing_layer 9
route_auto -max_detail_route_iterations 30
route_opt
route_eco
check_lvs
report_congestion
report_timing
report_constraints -all_violators
report_timing
check_pg_connectivity
check_pg_drc
check_pg_missing_vias
gui_error_browser -hide
change_selection 
gui_zoom -window [gui_get_current_window -view] -full
write_script -force -format icc2 -output /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/output/riscv_MACRO_no_clk_alu_spef
write_parasitics -output /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/output/riscv_MACRO_no_clk_alu_parasitics
write_sdf /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/output/riscv_MACRO_no_clk_alu.sdf
write_verilog /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/output/riscv_MACRO_no_clk_alu.v
write_gds /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/output/riscv_MACRO_no_clk_alu.gds
write_sdc -output /home1/PD08/Vaishnavii/VLSI_PD/Main_Project_RISC_V/ICC2_PnR/MACRO_no_clk/output/riscv_MACRO_no_clk_alu.sdc
save_block -as MACRO_with_no_clk_ALU_done
